#+startup: beamer
#+title: Advanced mixed-models workshop: Session 6
#+author: Dale Barr
#+email: dale.barr@glasgow.ac.uk
#+date: Bremen March 2015
#+OPTIONS: toc:nil H:2 ^:nil
#+LATEX_CLASS: beamer
#+LATEX_CLASS_OPTIONS: []
#+BEAMER_THEME: Boadilla
#+LATEX_HEADER: \makeatletter \def\verbatim{\scriptsize\@verbatim \frenchspacing\@vobeyspaces \@xverbatim} \makeatother

#+BEAMER_COLOR_THEME: seahorse
#+LATEX_HEADER: \definecolor{lgray}{rgb}{0.90,0.90,0.90}
#+LATEX_HEADER: \beamertemplatenavigationsymbolsempty
#+LATEX_HEADER: \usemintedstyle{tango}
#+LATEX_HEADER: \institute{University of Glasgow}

#+COLUMNS: %40ITEM %10BEAMER_env(Env) %9BEAMER_envargs(Env Args) %4BEAMER_col(Col) %10BEAMER_extra(Extra)

#+PROPERTY: header-args:R :session *R* :exports both :results output verbatim :tangle session_06.R

** Before doing analysis: /look at your data/

#+BEGIN_SRC R :exports both :results output
  library(lme4)

  crefs <- readRDS("crefs.rds")
  head(crefs, 3)

  crefs_mit <- subset(crefs, ModInTrain) 

  with(crefs_mit, aggregate(Modifier ~ Novelty+Addressee+Feedback, FUN=mean))
#+END_SRC

#+RESULTS:
#+begin_example
  SessionID ItemID RespID Novelty Addressee Feedback ModInTrain Modifier  SOT
1        56      2   6314     New       New       No       TRUE        0 1462
2        56      3   6319     New       New       No       TRUE        0 1126
3        56      7   6315     Old       New       No       TRUE        1 1695
  Novelty Addressee Feedback   Modifier
1     New       New       No 0.10526316
2     Old       New       No 0.61224490
3     New       Old       No 0.08771930
4     Old       Old       No 0.75510204
5     New       New      Yes 0.06779661
6     Old       New      Yes 0.62500000
7     New       Old      Yes 0.06896552
8     Old       Old      Yes 0.76000000
#+end_example

** Creating predictor variables

#+BEGIN_SRC R
crefs_mit2 <- transform(crefs_mit, N=ifelse(Novelty=="New",1,0),
                    A=ifelse(Addressee=="New",1,0),
                    F=ifelse(Feedback=="Yes",1,0))
crefs_mit2c <- transform(crefs_mit2,
                     Nc=N-mean(N),
                     Ac=A-mean(A),
                     Fc=F-mean(F))                          

head(crefs_mit2c)
#+END_SRC

#+RESULTS:
#+begin_example
  SessionID ItemID RespID Novelty Addressee Feedback ModInTrain Modifier  SOT N
1        56      2   6314     New       New       No       TRUE        0 1462 1
2        56      3   6319     New       New       No       TRUE        0 1126 1
3        56      7   6315     Old       New       No       TRUE        1 1695 0
4        56      8   6318     Old       New       No       TRUE        1 1137 0
5        56     13   6382     New       New       No       TRUE        0  986 1
6        56     12   6384     New       New       No       TRUE        0  928 1
  A F         Nc        Ac         Fc
1 1 0  0.4530892 0.5057208 -0.4988558
2 1 0  0.4530892 0.5057208 -0.4988558
3 1 0 -0.5469108 0.5057208 -0.4988558
4 1 0 -0.5469108 0.5057208 -0.4988558
5 1 0  0.4530892 0.5057208 -0.4988558
6 1 0  0.4530892 0.5057208 -0.4988558
#+end_example

